// Напишемо скрипт files.js
// читатиме поточний каталог та виводити його вміст: ім'я файлу, його розмір та дату останньої зміни.
const fs = require("fs").promises;
// Спочатку ми підключаємо стандартний модуль fs з промісами

fs.readdir(__dirname)
  // За допомогою змінної __dirname ми зчитуємо всі файли із поточного каталогу
  .then((files) => {
    return Promise.all(
      files.map(async (filename) => {
        const stats = await fs.stat(filename);
        return {
          Name: filename,
          Size: stats.size,
          Date: stats.mtime,
        };
      })
    );
  })
  .then((result) => console.table(result));

//   Внаслідок виконання промісу в змінну files ми отримаємо масив імен файлів та директорій з поточної директорії. Потім ми повертаємо масив промісів з аналізом кожного елемента цього масиву. Провести аналіз допомагає нам змінна stats, куди ми отримуємо інформацію про поточний файл. Ми повертаємо об'єкт з ім'ям файлу, а також stats.mtime час останньої зміни файлу та stats.size, який визначає розмір файлу в байтах.
// Результат виконання цього промісу, змінна result, ми віддаємо функції console.table і отримуємо красиву таблицю при виконанні нашого скрипту у консолі
