// Щоб використовувати інтерактивне введення в консолі на кшталт питання-відповідь, ми будемо використовувати стандартний модуль Node.js readline.
const readline = require("readline");
const rl = readline.createInterface({
  input: process.stdin, // введення зі стандартного потоку
  output: process.stdout, // виведення у стандартний потік
});

// Ми підключаємо модуль та створюємо екземпляр rl де в опціях передаємо потоки введення та виведення, консоль, файл і т.д. У нашому випадку ми беремо стандартні потоки та будемо працювати в консолі, де запускаємо скрипт. Обробка кожного введеного рядка відбувається через подію line:

rl.on("line", (cmd) => {
  console.log(`You just typed: ${cmd}`);
});

rl.question("Як вас звати?", (answer) => {
  console.log(`Приємно познайомитися ${answer}`);
});

// Також при якійсь тривалій операції ми можемо поставити розмову на паузу або іншими словами заблокувати введення:

// rl.pause();

// Щоб закрити інтерфейсом readline, необхідно виконати функцію:

// rl.close();
